Tekla Open API Reference for Tekla Structures 2025
ViewHandler.RedrawView Method
Redraws a model view.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool RedrawView(
	View view
)
Public Shared Function RedrawView (
	view As View
) As Boolean
Parameters
view
Type: Tekla.Structures.Model.UI.View
The view that is to be redrawn.
Return Value
Type: Boolean
True on success.
See Also
Reference
ViewHandler Class
Tekla.Structures.Model.UI Namespace